Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor(Autodesk.Revit.DB.Lighting.RectangleLightShape)
Creates a copy of the given rectangle light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013